#define _CRT_SECURE_NO_WARNINGS	
#include<stdio.h>
//struct BOOK
//{
//	char name[20];
//	char id[20];
//	int price;
//};
//int main()
//{
//	int num = 10;
//	//结构体成员访问操作
//	struct BOOK b = { "C语言","c20210509",55 };
//	struct BOOK* pb = &b;
//	//结构体指针->成员名
//	printf("%s %s %d", pb->name, pb->id, pb->price);
//	printf("%s %s %d", b.name, b.id, b.price);
//
//	return 0;
//}

//整形提升
/*
C的整型算术运算总是至少以缺省整型类型的精度来进行的。
为了获得这个精度，表达式中的字符和短整型操作数在使用之前被转换为普通整型，这种转换称为整型
提升。
*/
int main()
{
	char a = 3;
	//00000000000000000000000000000011
	//00000011 - a
	char b = 127;
	//00000000000000000000000001111111
	//01111111 - b

	char c = a + b;
	//00000000000000000000000000000011
	//00000000000000000000000001111111
	//00000000000000000000000010000010
	
	//10000010 - c
	//11111111111111111111111110000010 - 补码
	//11111111111111111111111110000001 - 反码
	//10000000000000000000000001111110 - 原码
	//-126
	//发现a和b都是char类型的，都没有达到一个int的大小
	//这里就会发生整形提升

	printf("%d\n", c); //-126

	return 0;
}

